NextFOAM-2501/tutorials/multiphase/overInterPhaseChangeDyMFoam/twoSimpleRotors/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   #includeEtc "caseDicts/setConstraintTypes"

    "(outlet|inlet)"
    {
        type            calculated;
        value           $internalField;
    }

    "(walls|hole)"
    {
        type            compressible::alphatWallFunction;
        value           $internalField;
    }

    overset
    {
        type            overset;
    }
}


// ************************************************************************* //
